package com.exz.antcargo.activity.popupwindow;

public class FilterDataSource {

	public static final int FILTER_DATA_TYPE_LOCATION = 1;
	public static final int FILTER_DATA_TYPE_DISTANCE = 2;
	public static final int FILTER_DATA_TYPE_PRICE = 3;
	public static final int FILTER_DATA_TYPE_SORT = 4;

	public static String[] createPaixuItems() {
		String[] xuanze = { "综合排序", "价格升序", "价格降序" };
		return xuanze;
	}
	
	
	
	public static String[] createSortFilterItems() {
		String names[] = new String[] {"全部", "1年", "2年", "3年", "4年", "5年", "6年", "7年", "8年",
				"9年", "10年"  };
		return names;
	}
	
	public static String[] createProviceItems() {
		String provice[] = new String[] { "全部", "北京市", "天津市", "河北省", "山西省", "内蒙古自治区",
				"辽宁省", "吉林省", "黑龙江省", "上海市", "江苏省", "浙江省", "安徽省", "福建省", "江西省",
				"山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆市", "四川省",
				"贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区",
				"澳门特别行政区", "台湾省", "香港特别行政区"  };
		return provice;
	}
	
	public static String[][] createCityItems() {
		String[][] city = new String[][] {
				new String[] { "全部" },
				new String[] { "北京市" },
				new String[] { "天津市" },
				new String[] { "石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市",
						"承德市", "沧州", "廊坊市 ", "衡水市" },
				new String[] { "太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市",
						"运城市", "忻州市", "临汾市", "吕梁市" },
				new String[] { "呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市",
						"呼伦贝尔市", "乌兰察布市", "锡林郭勒盟", "巴彦淖尔市", "阿拉善盟", "兴安盟" },
				new String[] { "沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市",
						"葫芦岛市", "营口市", "盘锦市", "阜新市", "辽阳市", "铁岭市", "朝阳市" },
				new String[] { "长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市",
						"白城市", "延边朝鲜族自治州" },
				new String[] { "哈尔滨市", "齐齐哈尔市", "鹤岗市", "双鸭山市", "鸡西市", "大庆市", "伊春市",
						"牡丹江市", "佳木斯市", "七台河市", "黑河市", "绥化市", "大兴安岭地区" },
				new String[] { "上海市" },
				new String[] { "南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市",
						"淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市" },
				new String[] { "杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市",
						"衢州市", "舟山市", "台州市", "丽水市" },
				new String[] { "合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市",
						"安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市",
						"池州市", "宣城市" },
				new String[] { "福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市",
						"龙岩市", "宁德市" },
				new String[] { "南昌市", "景德镇市", "萍乡市", "新余市", "九江市", "鹰潭市", "赣州市",
						"吉安市", "宜春市", "抚州市", "上饶市" },
				new String[] { "济南市", "青岛市", "淄博市", "枣庄市", "东营市", "潍坊市", "烟台市",
						"威海市", "济宁市", "泰安市", "日照市", "莱芜市", "德州市", "临沂市", "聊城市",
						"滨州市", "菏泽市" },
				new String[] { "郑州市", "开封市", "洛阳市", "平顶山市", "焦作市", "鹤壁市", "新乡市",
						"安阳市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市",
						"周口市", "驻马店市", "济源市" },
				new String[] { "武汉市", "黄石市", "襄樊市", "十堰市", "荆州市", "宜昌市", "荆门市",
						"鄂州市", "孝感市", "黄冈市", "咸宁市", "随州市", "仙桃市", "天门市", "潜江市",
						"神农架", "恩施土家族苗族自治州" },
				new String[] { "长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市",
						"张家界市", "益阳市", "郴州市", "怀化市", "娄底市", "湘西土家族苗族自治州", "永州市" },
				new String[] { "广州市", "深圳市", "珠海市", "汕头市", "韶关市", "佛山市", "江门市",
						"湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市",
						"清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市" },
				new String[] { "南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市",
						"贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市" },
				new String[] { "海口市", "三亚市" },
				new String[] { "重庆市" },
				new String[] { "成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市",
						"遂宁市", "内江市", "乐山市", "南充市", "宜宾市", "广安市", "达州市", "眉山市",
						"雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州 " },
				new String[] { "贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "毕节地区",
						"黔西南布依族苗族自治州 ", "黔东南苗族侗族自治州", "黔南布依族苗族自治州" },
				new String[] { "昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市",
						"临沧市", "文山壮族苗族自治州", "红河哈尼族彝族自治州", "西双版纳傣族自治州", "楚雄彝族自治州",
						"大理白族自治州", "德宏傣族自治州", "怒江傈傈族自治州", "迪庆藏族自治州" },
				new String[] { "拉萨市", "那曲地区", "昌都地区", "山南地区", "日喀则地区", "阿里地区",
						"林芝地区" },
				new String[] { "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市",
						"榆林市", "安康市", "商洛市" },
				new String[] { "兰州市", "金昌市", "白银市", "天水市", "嘉峪关市", "武威市", "张掖市",
						"平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州" },
				new String[] { "西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州",
						"果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州" },
				new String[] { "银川市", "石嘴山市", "吴忠市", "固原市", "中卫市" },
				new String[] { "乌鲁木齐市", "克拉玛依市", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市",
						"吐鲁番地区", "哈密地区", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏苏柯尔克孜自治州",
						"巴音郭楞蒙古自治州", "昌吉回族自治州", "博尔塔拉蒙古自治州", "伊犁哈萨克自治州", "塔城地区",
						"阿勒泰地区" }, new String[] { "澳门特别行政区" },
				new String[] { "台湾省" }, new String[] { "香港特别行政区" } };
		return city;
	}
}
